###############################################################
#  Generated by:      Cadence Innovus 23.31-s109_1
#  OS:                Linux x86_64(Host ID ei-vm-018.othr.de)
#  Generated on:      Tue Jun 10 21:05:34 2025
#  Design:            serial_to_parallel
#  Command:           saveDesign serial_to_parallel.enc -tcon
###############################################################
current_design serial_to_parallel
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 0.562000 -waveform {0.000000 0.275000}
set_propagated_clock  [get_ports {clk}]
#END OF CLOCK SECTION#
set_load -pin_load -max  0.5  [get_ports {p_o[7]}]
set_load -pin_load -min  0.5  [get_ports {p_o[7]}]
set_max_transition 0.0002  [get_ports {p_o[7]}]
set_load -pin_load -max  0.5  [get_ports {p_o[6]}]
set_load -pin_load -min  0.5  [get_ports {p_o[6]}]
set_max_transition 0.0002  [get_ports {p_o[6]}]
set_load -pin_load -max  0.5  [get_ports {p_o[5]}]
set_load -pin_load -min  0.5  [get_ports {p_o[5]}]
set_max_transition 0.0002  [get_ports {p_o[5]}]
set_load -pin_load -max  0.5  [get_ports {p_o[4]}]
set_load -pin_load -min  0.5  [get_ports {p_o[4]}]
set_max_transition 0.0002  [get_ports {p_o[4]}]
set_load -pin_load -max  0.5  [get_ports {p_o[3]}]
set_load -pin_load -min  0.5  [get_ports {p_o[3]}]
set_max_transition 0.0002  [get_ports {p_o[3]}]
set_load -pin_load -max  0.5  [get_ports {p_o[2]}]
set_load -pin_load -min  0.5  [get_ports {p_o[2]}]
set_max_transition 0.0002  [get_ports {p_o[2]}]
set_load -pin_load -max  0.5  [get_ports {p_o[1]}]
set_load -pin_load -min  0.5  [get_ports {p_o[1]}]
set_max_transition 0.0002  [get_ports {p_o[1]}]
set_load -pin_load -max  0.5  [get_ports {p_o[0]}]
set_load -pin_load -min  0.5  [get_ports {p_o[0]}]
set_max_transition 0.0002  [get_ports {p_o[0]}]
set_wire_load_mode top
set_input_delay -add_delay 0.001 -max -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 0.001 -max -clock [get_clocks {clk}] [get_ports {serial_in}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[7]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[7]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[5]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[5]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[3]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[3]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[1]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[1]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[6]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[6]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[4]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[4]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[2]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[2]}]
set_output_delay -add_delay 0.0015 -min -clock [get_clocks {clk}] [get_ports {p_o[0]}]
set_output_delay -add_delay 0.002 -max -clock [get_clocks {clk}] [get_ports {p_o[0]}]
set_clock_uncertainty 0.0001 -setup [get_clocks {clk}]
set_false_path  -from [get_ports {rst_n}] 
